// задача 2
//Console.Write("Введите число 1: ");
//int number1 =int.Parse (Console.ReadLine()!) ;
//Console.Write("Введите число 2: ");
//int number2 =int.Parse (Console.ReadLine()!) ;


//if (number1>number2) 
//{
 //   int max = number1;
 //  int min = number2;

//Console.Write($"Максимальное число  {max}");
//Console.Write($"Минимальное число  {min}");
//}
//else
//{
   //int max = number2;
   // int min = number1; 
//Console.Write($"Максимальное число  {max}");
//Console.Write($"Минимальное число число  {min}");
//}


//Задача 4!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

Console.Write("Введите число 1: ");
int number1 =int.Parse (Console.ReadLine()!) ;
Console.Write("Введите число 2: ");
int number2 =int.Parse (Console.ReadLine()!) ;
Console.Write("Введите число 3: ");
int number3 =int.Parse (Console.ReadLine()!) ;


